uhnp/src/Catalogs/ПредприятияВЕТИС/ПредприятияВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПредприятияВЕТИС</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВерсионныхОбъектовВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыПредприятийВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеАдреса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <comment>Внутренние значения полей адреса (контактная информация)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаИдентификатор</name>
    <comment>Глобальный идентификатор страны в соответствии со справочником РСХН</comment>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионИдентификатор</name>
    <comment>Глобальный идентификатор региона в соответствии со справочником РСХН</comment>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонИдентификатор</name>
    <comment>Глобальный идентификатор района в соответствии со справочником РСХН</comment>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаселенныйПунктИдентификатор</name>
    <comment>Глобальный идентификатор населенного пункта в соответствии со справочником РСХН</comment>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВРеестре</name>
    <type>
      <types>EnumRef.СтатусыПредприятийВРеестреЦерберВЕТИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НомераПредприятий</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ПредприятияВЕТИС/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаДанныеВЕТИС.Видимость = ПравоДоступа("Изменение", Метаданные.Справочники.ПредприятияВЕТИС);
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПредприятияВЕТИС"
		И (Источник = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Структура")
				И Параметр.Свойство("Ссылка")
				И Параметр.Ссылка = Объект.Ссылка)) Тогда
		
		Прочитать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДанныеВЕТИС(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Идентификатор",                 Объект.Идентификатор);
	ПараметрыФормы.Вставить("НеПоказыватьСостояниеЗагрузки", Истина);
	
	ОткрытьФорму(
		"Справочник.ПредприятияВЕТИС.Форма.ДанныеКлассификатора",
		ПараметрыФормы, ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти
